Revit 2027 API
FailuresAccessor.GetFailureMessages(FailureSeverity) Method
 Provides access to the individual failure messages if a given severity currently posted in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureMessageAccessor> GetFailureMessages(
	FailureSeverity severity
)
Public Function GetFailureMessages (
	severity As FailureSeverity
) As IList(Of FailureMessageAccessor)
public:
IList<FailureMessageAccessor^>^ GetFailureMessages(
	FailureSeverity severity
)
member GetFailureMessages :
        severity : FailureSeverity -> IList<FailureMessageAccessor>
Parameters
severity FailureSeverity
 The failure severity for which failure messages are requested. If the requested severity is None, an empty collection is returned.
Return Value
IList<FailureMessageAccessor>
 Accessors to the individual failure messages of a given severity posted in the document.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  This FailuresAccessor is inactive (is used outside of failures processing).
See Also
Reference
FailuresAccessor Class
GetFailureMessages Overload
Autodesk.Revit.DB Namespace